{
    "notFound": "Sidan kunde inte hittas",
    "home": {
        "title": "Hem",
        "description1":
            "Välkommen till min portfolio! Denna sida kommer att uppdateras löpande allt eftersom jag blir klar med fler projekt. Om du vill se det mesta av det jag har gjort hittills kan du gå till ",
        "gitHub": "min GitHub-sida",
        "description2":
            ". Om du vill ha en mer raffinerad upplevelse kan du utforska ",
        "link": "mina projekt."
    },
    "contact": {
        "title": "Kontakt",
        "description":
            "Det kommer att finnas en e-postadress här så småningom. Under tiden bör du inte tveka att kontakta mig via <0>LinkedIn</0> eller besöka min profil på <1>GitHub</1>."
    },
    "projects": {
        "title": "Projekt",
        "description":
            "Det här är en sida där du kan se ett urval av de projekt jag har jobbat på. Denna sida kommer att uppdateras regelbundet.",
        "portfolio": {
            "title": "Min portfolio hemsida",
            "teaser":
                "Den hemsidan du är på just nu! Gjord med React, med lite Next.js och Tailwind ovanpå. Klicka på kortet för att lära dig mer!",
            "description":
                "Den här webbplatsen är för närvarande ett pågående arbete. Den är skriven i TypeScript, med Next.js som ramverk för att kunna använda dess utmärkta app-routersystem och React eftersom det är det jag är mest bekväm med. Några av de komponenter som används här är hämtade från Shadcn-biblioteket, och alla komponenter använder Tailwind CSS v.4. Lokalisering hanteras med i18next. Om du läser detta på webben, är det Vercel som hanterar hosting. All kod finns tillgänglig på min <1>GitHub-sida som finns här</1>.\n\nUnder mitt arbete med den här webbplatsen har jag lärt mig mycket om de system som nämns ovan och hur de används, liksom hur man på egen hand kan se ett projekt som detta från början till slut. Jag tror att detta kommer att vara användbart både i mitt arbete på samma stack (se webbprojektet <2>här</2>) och på helt andra projekt i framtiden"
        },
        "web": {
            "title": "Fsektionen.se",
            "teaser":
                "Hemsidan för min studentkår vid Lunds Tekniska Högskola, skriven med nästan samma stack som denna hemsida. Inte publicerad ännu.",
            "description":
                "Sedan början på 2025 har jag tillsammans med andra medlemmar i programmeringskommittén på min studentsektion arbetat med att bygga om sektionens webbplats (den gamla som nu tar upp fsektionen.se är cirka 11 år gammal). Precis som denna webbplats är den skriven i TypeScript, med Next.js som ramverk och React som huvudbibliotek. Vi använder Tailwind och Shadcn-biblioteket för styling, och lokaliseringshanteringen sker via i18next. Webbplatsen är hostad på vår egen server och kommunicerar med backend via FastAPI. Databasen är baserad på PostgreSQL och använder SQLAlchemy som ORM. Jag har begränsad erfarenhet av utveckling av vår backend, men har arbetat med den tillräckligt för att förstå strukturen och kunna göra mindre ändringar vid behov. Koden för frontend finns tillgänglig på vår GitHub-sida <3>här</3>, och backend-koden kan nås på samma sätt <4>här</4>.\n\nAtt arbeta med den nya webbplatsen har gett mig mycket erfarenhet av att jobba i team av olika storlekar, samt hur man utvecklar funktioner som behöver vara tillräckligt flexibla för att anpassas när designen slutligen fastställs och tillräckligt konfigurerbara för att passa in på helt olika delar av webbplatsen."
        },
        "app": {
            "title": "F-sektionens app",
            "teaser":
                "Appen som används av min studentkår, som jag arbetat ideellt med under mer än ett år. Skriven i Dart med Flutter. Arbetet med appen har förbättrat min förmåga att arbeta i team med ett snabbt utvecklingsschema. Klicka på kortet för att se koden!"
        }
    },
    "nav": {
        "home": "Hem",
        "projects": "Projekt",
        "contact": "Kontakt"
    },
    "footer": "Skapad med ❤️ i React. Klicka här för att se mer detaljer."
}